In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
import warnings 
warnings.filterwarnings('ignore')

In [3]:
user_df = pd.read_csv('BX-Users.csv',encoding='latin-1')

In [4]:
user_df

       user_id                            Location   Age
0            1                  nyc, new york, usa   NaN
1            2           stockton, california, usa  18.0
2            3     moscow, yukon territory, russia   NaN
3            4           porto, v.n.gaia, portugal  17.0
4            5  farnborough, hants, united kingdom   NaN
...        ...                                 ...   ...
278854  278854               portland, oregon, usa   NaN
278855  278855  tacoma, washington, united kingdom  50.0
278856  278856           brampton, ontario, canada   NaN
278857  278857           knoxville, tennessee, usa   NaN
278858  278858                dublin, n/a, ireland   NaN

[278859 rows x 3 columns]

In [5]:
user_df.shape

(278859, 3)

In [6]:
user_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 278859 entries, 0 to 278858
Data columns (total 3 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   user_id   278859 non-null  object
 1   Location  278858 non-null  object
 2   Age       168096 non-null  float64
dtypes: float64(1), object(2)
memory usage: 6.4+ MB

In [7]:
books_df =  pd.read_csv('BX-Books.csv',encoding='latin-1')

In [8]:
books_df.head()

,isbn,book_title,book_author,year_of_publication,publisher
0,195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press
1,2005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada
2,60973129,Decision in Normandy,Carlo D'Este,1991,HarperPerennial
3,374157065,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata,1999,Farrar Straus Giroux
4,393045218,The Mummies of Urumchi,E. J. W. Barber,1999,W. W. Norton &amp; Company

In [9]:
books_df.shape

(271379, 5)

# Clean up NaN values

In [10]:
user_df.isnull().sum()

user_id          0
Location         1
Age         110763
dtype: int64

In [11]:
books_df.isnull().sum()

isbn                   0
book_title             0
book_author            1
year_of_publication    0
publisher              2
dtype: int64

In [12]:
user_df= user_df.dropna(axis=0)

In [13]:
user_df.isnull().sum()

user_id     0
Location    0
Age         0
dtype: int64

# Read the data where ratings are given by users

In [14]:
books_rating_df = pd.read_csv('BX-Book-Ratings.csv',encoding='latin-1',nrows=10000)

In [15]:
books_rating_df

      user_id        isbn  rating
0      276725  034545104X       0
1      276726   155061224       5
2      276727   446520802       0
3      276729  052165615X       3
4      276729   521795028       6
...       ...         ...     ...
9995      243   425164403       0
9996      243   440224764       0
9997      243   440225701       0
9998      243   440226430       0
9999      243   440234743       0

[10000 rows x 3 columns]

In [16]:
books_rating_df.shape

(10000, 3)

In [17]:
books_rating_df.isnull().sum()

user_id    0
isbn       0
rating     0
dtype: int64

Merging two datasets

In [18]:
df = pd.merge(books_df,books_rating_df, on='isbn')

In [19]:
df.head()

,isbn,book_title,book_author,year_of_publication,publisher,user_id,rating
0,195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press,2,0
1,2005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,8,5
2,60973129,Decision in Normandy,Carlo D'Este,1991,HarperPerennial,8,0
3,374157065,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata,1999,Farrar Straus Giroux,8,0
4,393045218,The Mummies of Urumchi,E. J. W. Barber,1999,W. W. Norton &amp; Company,8,0

In [20]:
df.shape

(8701, 7)

In [21]:
df.tail()

,isbn,book_title,book_author,year_of_publication,publisher,user_id,rating
8696,767907566,All Elevations Unknown: An Adventure in the He...,Sam Lightner,2001,Broadway Books,278851,5
8697,884159221,Why stop?: A guide to Texas historical roadsid...,Claude Dooley,1985,Lone Star Books,278851,7
8698,912333022,The Are You Being Served? Stories: 'Camping In...,Jeremy Lloyd,1997,Kqed Books,278851,7
8699,1569661057,"Dallas Street Map Guide and Directory, 2000 Ed...",Mapsco,1999,American Map Corporation,278851,10
8700,345251547,Mister God This Is Anna,Fynn,1976,Ballantine Books,277187,0

# Take a quick look at the number of unique users and books

In [22]:
users = df['user_id'].unique()

In [23]:
len(users)

828

In [24]:
# number of unique users
print('Number of unique user {}'.format(len(users)))

Number of unique user 828

In [25]:
books = df['isbn'].unique()
len(books)

8051

In [26]:
# number of unique books
print(f'number of uniqe books: {len(books)}')

number of uniqe books: 8051

# Convert the user_id variable to numeric numbers in the correct order

In [27]:
# convert user_id into numeric order
list_userid = df.user_id.unique()
print('Number of unique user {}'.format(len(list_userid)))

Number of unique user 828

In [28]:
list_userid

array([     2,      8, 277478, 278144,      9,    243, 277711, 278418,
           10,     12,     14, 276925, 276939, 276954, 277042, 277157,
       277378, 277427, 277530, 277932, 278137, 278176, 278373, 278514,
          193,    242, 277965,     16,     17,     19,     20,     22,
       277195, 277641,     23, 276953, 277743,     26, 277722, 277744,
           32,     36,     39,     42, 278390,     44, 278188, 277168,
       277922, 278333,     51,     53,     56,     64,     67, 278535,
       277689, 278221, 278843,     68,     69,     70,     73,     75,
       278851,     77,     78,     79,     81,     82,     83,     85,
           86,     87,     88, 277698,     91,     92, 277928,     95,
          125,     97, 278202,     99, 276755, 277647,    102,    107,
          109,    110,    114, 278153, 278561,    165, 277439, 278254,
       278422,    129,    132,    133,    135, 277187,    139,    141,
       278342,    144,    151,    160,    162, 277315, 278692,    169,
          176,    178,    183, 277783, 277827, 277828,    185,    190,
          199,    202,    204, 278002,    207,    212,    215,    217,
          224,    226,    228,    230, 276796,    232, 277123,    236,
          237,    241, 278218, 277706, 277523, 277569, 278819, 278554,
       278633, 276746, 278026, 277246, 277517, 277901, 278075, 278723,
       277203, 278832, 278681, 278104, 278085, 278356, 277212, 277411,
       278257, 278586, 276994, 277803, 277958, 278541, 278800, 277413,
       277752, 278255, 277819, 277937, 278813, 277987, 278552, 277873,
       278798, 277197, 277816, 277462, 278350, 277629, 277363, 277959,
       278243, 278446, 277915, 277554, 278044, 278506, 278112, 278490,
       277639, 277196, 277563, 278487, 276986, 276847, 277938, 278185,
       276856, 277681, 277589, 277096, 277072, 278781, 277623, 278119,
       278172, 277466, 278014, 277229, 278525, 276822, 277051, 278469,
       277124, 277244, 277807, 278194, 277895, 278007, 278220, 277533,
       277904, 276929, 277984, 277884, 277562, 277048, 276866, 277962,
       277230, 278582, 278653, 278556, 277879, 278106, 278551, 277651,
       278522, 278503, 277898, 276998, 276988, 277945, 278361, 277513,
       276832, 277018, 277923, 277737, 278550, 277662, 278314, 278672,
       277903, 277598, 277143, 277954, 278346, 277764, 277109, 277469,
       278079, 277601, 277435, 276804, 276747, 277170, 278019, 278755,
       277888, 277997, 278409, 278641, 278500, 277171, 276754, 276964,
       278048, 277892, 278158, 276878, 278162, 277470, 278771, 276788,
       277257, 277036, 277756, 277798, 277837, 277817, 278483, 278773,
       278227, 277575, 277710, 278259, 277705, 278325, 276869, 278251,
       278543, 278107, 277107, 277436, 278524, 276984, 276800, 277619,
       276896, 276725, 277502, 277648, 276887, 278849, 276957, 277826,
       276875, 278131, 278439, 276798, 277375, 276848, 276936, 278492,
       276928, 278545, 278760, 277032, 277776, 277812, 277633, 277759,
       277778, 278663, 278854, 277765, 277808, 277506, 277529, 277790,
       278161, 278432, 277969, 278274, 278846, 278022, 278536, 278431,
       278054, 278307, 276838, 277508, 278197, 278122, 277235, 277794,
       277768, 277009, 278601, 276837, 276884, 277245, 277535, 276762,
       277237, 278139, 278644, 278645, 276989, 277453, 276888, 278216,
       277272, 278023, 278203, 278818, 277547, 277179, 277838, 277474,
       277261, 277525, 278698, 276828, 278024, 278401, 276811, 276904,
       278064, 277288, 278828, 277518, 277527, 277595, 278769, 277746,
       276862, 277434, 277556, 278542, 277840, 277253, 277114, 278520,
       277338, 278724, 278199, 278253, 278844, 277982, 278159, 278807,
       277087, 278056, 278782, 277293, 278100, 278571, 278836, 277894,
       276911, 278528, 276840, 277509, 278388, 277330, 277929, 277911,
       278263, 278774, 277691, 277712, 276889, 278160, 277231, 277471,
       277568, 278796, 278264, 277364, 277814, 277823, 277844, 278732,
       278411, 277660, 278563, 278778, 277183, 278795, 278568, 276744,
       277094, 277761, 278200, 276872, 277775, 277769, 278181, 277835,
       278008, 277727, 276997, 277139, 277408, 277919, 276859, 276861,
       276727, 277588, 276850, 277989, 277265, 277913, 277135, 277801,
       277228, 278396, 277532, 278565, 278270, 278111, 277802, 278096,
       277975, 278648, 277696, 277116, 277841, 278212, 278249, 277795,
       278740, 278461, 277921, 276830, 277165, 277748, 277397, 278820,
       278488, 276814, 277627, 278465, 277791, 278184, 278246, 278767,
       278012, 278533, 278838, 278120, 278452, 277781, 277811, 277012,
       278825, 277220, 278652, 278435, 277793, 277845, 277700, 278569,
       277155, 278694, 277142, 278824, 278300, 277314, 277374, 278345,
       278095, 277240, 278475, 278540, 277586, 278534, 278683, 278675,
       278637, 277877, 277291, 277565, 277284, 278784, 277473, 278669,
       278148, 277341, 277682, 278539, 277281, 277243, 278238, 277560,
       277035, 278831, 276916, 276772, 278668, 277998, 277285, 277882,
       276780, 276813, 277400, 277825, 277777, 276852, 277728, 278365,
       277779, 277405, 277579, 277787, 277028, 278772, 278279, 278140,
       278336, 277665, 277788, 277053, 278479, 277740, 278512, 276751,
       277864, 276820, 277424, 277317, 277040, 277908, 277786, 277610,
       277189, 277292, 278400, 277402, 277526, 276808, 277632, 278156,
       278319, 277799, 277188, 278466, 277809, 278297, 278474, 278786,
       277085, 276854, 277842, 278155, 278209, 277186, 277548, 277992,
       277701, 278377, 278224, 278110, 277646, 278357, 278510, 278515,
       278715, 278529, 278750, 277594, 278501, 277367, 278394, 278302,
       278462, 278213, 278721, 278459, 276817, 278177, 277205, 277832,
       277720, 276774, 276975, 277486, 278328, 278117, 276915, 278089,
       278364, 276905, 277340, 277271, 277010, 277622, 277544, 278092,
       278449, 277348, 278852, 277800, 277636, 278597, 277128, 278815,
       277457, 277432, 278280, 277782, 278650, 277930, 277065, 277596,
       277056, 277833, 277519, 278021, 277353, 278245, 277444, 277820,
       278634, 276890, 278620, 277019, 278058, 278355, 278250, 277134,
       277343, 278398, 277813, 277824, 277797, 278777, 278752, 278615,
       278444, 277891, 278720, 277650, 276833, 278573, 278030, 278070,
       277909, 278043, 276786, 278207, 277687, 278710, 277946, 277843,
       276748, 277830, 276733, 278167, 277031, 277714, 278063, 277242,
       278069, 278665, 277351, 278759, 278204, 278149, 276853, 277488,
       278789, 277818, 278193, 277964, 278538, 278531, 277918, 278316,
       278458, 278244, 277585, 278450, 277697, 278334, 277767, 277359,
       278368, 278559, 277180, 278389, 277073, 278020, 278537, 276963,
       277996, 278378, 278491, 277389, 278358, 277978, 277023, 277774,
       278235, 278168, 278610, 278788, 278731, 277953, 277274, 277988,
       278065, 278215, 276726, 278311, 278074, 277269, 278094, 278017,
       278747, 277256, 276729, 276835, 276912, 276927, 276949, 276950,
       277002, 277079, 277262, 277379, 277380, 277388, 277433, 277479,
       277514, 277528, 277538, 277559, 277574, 277605, 277657, 277680,
       277784, 277831, 277834, 277872, 278009, 278034, 278066, 278098,
       278183, 278237, 278248, 278260, 278330, 278376, 278621, 278636,
       278659, 278713, 278714, 278729], dtype=int64)

In [29]:
#ind = np.where(df.index==8696)[0]
#type(ind)

In [35]:
def user_id_num(user_id):
    itemindex = np.where(list_userid==user_id)
    return itemindex[0][0]

In [36]:
list_isbn = df.isbn.unique()

In [37]:
print('length of isbn unique values: {}'.format(len(list_isbn)))

length of isbn unique values: 8051

In [38]:
def isbn_num(isbn):
    itemindex = np.where(list_isbn==isbn)
    return itemindex[0][0]

# Convert both user_id and ISBN to the ordered list, i.e., from 0...n-1

In [39]:
df['user_id_order'] = df['user_id'].apply(user_id_num)

In [40]:
df['isbn_order'] = df['isbn'].apply(isbn_num)

In [41]:
df

,isbn,book_title,book_author,year_of_publication,publisher,user_id,rating,user_id_order,isbn_order
0,195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press,2,0,0,0
1,2005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,8,5,1,1
2,60973129,Decision in Normandy,Carlo D'Este,1991,HarperPerennial,8,0,1,2
3,374157065,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata,1999,Farrar Straus Giroux,8,0,1,3
4,393045218,The Mummies of Urumchi,E. J. W. Barber,1999,W. W. Norton &amp; Company,8,0,1,4
...,...,...,...,...,...,...,...,...,...
8696,767907566,All Elevations Unknown: An Adventure in the He...,Sam Lightner,2001,Broadway Books,278851,5,64,8046
8697,884159221,Why stop?: A guide to Texas historical roadsid...,Claude Dooley,1985,Lone Star Books,278851,7,64,8047
8698,912333022,The Are You Being Served? Stories: 'Camping In...,Jeremy Lloyd,1997,Kqed Books,278851,7,64,8048
8699,1569661057,"Dallas Street Map Guide and Directory, 2000 Ed...",Mapsco,1999,American Map Corporation,278851,10,64,8049
8700,345251547,Mister God This Is Anna,Fynn,1976,Ballantine Books,277187,0,101,8050

# Re-index the columns to build a matrix

In [42]:
ordered_col = ['user_id_order', 'isbn_order', 'rating', 'book_title', 'book_author', 'year_of_publication','publisher',
               'user_id', 'isbn']
df = df.reindex(columns=ordered_col)

In [43]:
df.head()

,user_id_order,isbn_order,rating,book_title,book_author,year_of_publication,publisher,user_id,isbn
0,0,0,0,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press,2,195153448
1,1,1,5,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,8,2005018
2,1,2,0,Decision in Normandy,Carlo D'Este,1991,HarperPerennial,8,60973129
3,1,3,0,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata,1999,Farrar Straus Giroux,8,374157065
4,1,4,0,The Mummies of Urumchi,E. J. W. Barber,1999,W. W. Norton &amp; Company,8,393045218

# Split your data into two sets (training and testing)

In [44]:
from sklearn.model_selection import train_test_split
train, test = train_test_split(df,test_size=0.30,random_state=10)

In [45]:
train.shape

(6090, 9)

In [46]:
test.head()

,user_id_order,isbn_order,rating,book_title,book_author,year_of_publication,publisher,user_id,isbn
7794,7,7145,0,The Iceberg and It's Shadow,Jan Greenberg,1989,Farrar Straus &amp; Giroux,278418,374435502
5451,7,4822,0,Zen and the City of Angels,Elizabeth M. Cosin,1999,St. Martin's Press,278418,312206119
8288,7,7638,0,Microsoft Mastering - Ecommerce Development: B...,Microsoft Corporation,1999,Microsoft Pr,278418,735608911
2853,396,2303,9,A House for Mr. Biswas,V. S. Naipaul,2001,Vintage Books USA,277527,375707166
5348,7,4719,0,Batman Returns: The Novelization,Craig Shaw Gardner,1992,Warner Books,278418,446363030

In [47]:
test.shape

(2611, 9)

# Make predictions based on user and item variables

In [53]:
train_matrix = np.zeros((len(users), len(books)))
for line in train.itertuples():
    train_matrix[line[1]-1, line[2]-1]=line[3]

test_matrix = np.zeros((len(users), len(books)))
for line in test.itertuples():
    test_matrix[line[1]-1, line[2]-1]=line[3]

In [108]:
from sklearn.metrics.pairwise import pairwise_distances
user_correlation = pairwise_distances(train_matrix,metric='cosine')
item_correlation = pairwise_distances(train_matrix.T,metric='cosine')

In [110]:
item_correlation.shape

(8051, 8051)

In [111]:
user_correlation

array([[0., 1., 1., ..., 1., 1., 1.],
       [1., 0., 1., ..., 1., 1., 1.],
       [1., 1., 0., ..., 1., 1., 1.],
       ...,
       [1., 1., 1., ..., 0., 1., 1.],
       [1., 1., 1., ..., 1., 0., 1.],
       [1., 1., 1., ..., 1., 1., 0.]])

In [112]:
train_matrix.shape

(828, 8051)

In [113]:
def predict(ratings,correlation,type='user'):
    if type == 'user':
        mean_user_rating = ratings.mean(axis=1)
        rating_diff = (ratings - mean_user_rating[:,np.newaxis])
        pred = mean_user_rating[:,np.newaxis]+correlation.dot(rating_diff)/np.array([np.abs(correlation).sum(axis=1)]).T
    elif type=='item':
        pred = ratings.dot(correlation) / np.array([np.abs(correlation).sum(axis=1)])
    return pred

In [114]:
user_pred = predict(train_matrix,user_correlation,type='user')

In [115]:
user_pred.shape

(828, 8051)

In [116]:
item_pred = predict(train_matrix,item_correlation.T,type = 'item')

In [117]:
item_pred.T.shape

(8051, 828)

# Use RMSE to evaluate the predictions

In [118]:
from sklearn.metrics import mean_squared_error
from math import sqrt
def rmse(prediction, ground_truth):
    prediction = prediction[ground_truth.nonzero()].flatten() 
    ground_truth = ground_truth[ground_truth.nonzero()].flatten()
    return sqrt(mean_squared_error(prediction, ground_truth))

In [119]:
print('user-based CF RMSE' + str(rmse(user_pred,test_matrix)))

user-based CF RMSE7.72185541212063

In [120]:
print('user-based CF RMSE' + str(rmse(item_pred,test_matrix)))

user-based CF RMSE7.721162031094573